"""Задача №55. Создать телефонный справочник с возможностью импорта и экспорта данных в 
формате .txt. Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.

Программа должна выводить данные
Программа должна сохранять данные в текстовом файле
Пользователь может ввести одну из характеристик для поиска определенной записи(Например имя или фамилию человека)
Использование функций. Ваша программа не должна быть линейной"""

# dict1 = {'яблоки': 100, 'бананы': 333, 'груши': 200,
#          'апельсины': 300, 'ананасы': 45, 'лимоны': 98,
#      	'сливы': 76, 'манго': 34, 'виноград': 90, 'лаймы': 230}
# dict2 = {'яблоки': 300, 'груши': 200, 'бананы': 400,
#      	'малина': 777, 'ананасы': 12, 'лаймы': 123, 'черника': 111, 'арбузы': 666}
# merged_dict = {key: dict1.get(key, 0) + dict2.get(key, 0) for key in set(dict1) | set(dict2)}
# print("Объединенный словарь:", merged_dict)